# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rake db:seed (or created alongside the db with db:setup).
#
# Examples:
#
#   cities = City.create([{ name: 'Chicago' }, { name: 'Copenhagen' }])
#   Mayor.create(name: 'Emanuel', city: cities.first)

admin = User.new(username: 'admin1', email: 'admin@example.com', password: 'insecure', phone_number: '+380934943954')
admin.skip_confirmation!
admin.save
admin.roles = ['admin', 'user']
admin.save!

# MuscleGroup
back = MuscleGroup.create(name: 'Спина', description: '')
chest = MuscleGroup.create(name: 'Груди', description: '')
biceps = MuscleGroup.create(name: 'Біцепс', description: '')
triceps = MuscleGroup.create(name: 'Тріцепс', description: '')
shoulders = MuscleGroup.create(name: 'Плечі', description: '')
legs = MuscleGroup.create(name: 'Ноги', description: '')
press = MuscleGroup.create(name: 'Прес', description: '')
=begin
cardio = MuscleGroup.create(name: 'Кардіо', description: '')
=end

#------------------------------------------------>
# Exercises
#-------------------Back------------------------->
des = 'Станова тяга це прекрасна, потужна  базова вправа, яка дозволить вам наростити м’язову масу і значно збільшити силу. Ніяка інша вправа не здатна дати такий же стимул для росту сили і об’ємів (окрім присідань з штангою, зрозуміло).
Основні працюючі м’язи: квадріцепси і біцепси стегна, напівсухожильні, напівперетинчасті м’язи, довгі розгиначі спини і інші м’язи попереку, щонайширші м’язи спини, ромбовидні м’язи, трапецієвидні м’язи, дельтовидні м’язи, передпліччя, біцепси рук.
Допоміжні м’язи: практично 90% усієї мускулатури тіла.
Варіанти виконання : найпоширеніший - класична станова тяга, гриф штанги береться хватом трохи ширше за коліна. Можливий і інший варіант - "сумо", хват грифа тут набагато вужчий, коліна розставлені в сторони. І, нарешті, можливий варіант тяги з прямими ногами, у такому разі основне навантаження падає на задню поверхню стегна і поперек.
Перед тим, як виконувати вправу, надіньте неслизьке взуття, в якому ваша стопа досить щільно "сидить". Обов’язково користуйтеся поясом штангіста, рукавичками або кистьовими ременями.'
url = 'https://www.youtube.com/watch?v=108Ga1EdL_Q'
ex1 = Exercise.create(name: 'Станова тяга', muscle_group: back, description: des, youtube_url: url)
description = 'Підійдіть максимально близько до грифа, розставте ноги на ширині плечей; трохи розведіть носки в сторони.
 Присядьте і випрямленими руками візьміться за гриф (хват допускається різний), при цьому внутрішня частина передпліччя повинна торкатися зовнішньої області стегон.
 Крім цього прослідкуйте, щоб гриф злегка торкався гомілки; рекомендується розташовувати його так, щоб при виконанні вправи він ковзав по ногах.
 Спина повинна бути прямою і лише трохи прогнутою в попереку, і в жодному разі не округленою.
 Таз повинен бути відведений назад, погляд спрямований перед собою, груди розправлені, плечі розгорнуті і розміщені над грифом.
 Глибоко вдихніть, стисніть сідниці, підтягніть плечі і починайте піднімати спину, одночасно розгинаючи тулуб і встаючи.
 У верхній точці, стегна підштовхніть і випряміть тулуб повністю; по ходу руху вага повинен перейти на п’яти.
 Після того, як подолаєте найбільш складну частину підйому, видихніть.
 Гриф опустіть по тому ж принципу, за яким піднімали, при цьому він повинен лише злегка торкнуться підлоги.
 Зробіть секундну паузу, після чого відразу ж піднімайтеся.'
ex1.steps(description)


des = 'Прекрасна вправа тяга штанги до поясу в нахилі, для розширення спини, надання їй красивої V -подібно форми; воно в комплексі діє на найширші м`язи спини, ромбовидні, трапецієвидні, лопаткові м`язи. Вправа є одним з основних для набору маси спини, надає їй товщини і об`єму.
    Основні задіяні м’язи: найширші спини (нижні і середні відділи), ромбовидні м’язи
Допоміжні м’язи: трапецієвидні, м’язи попереку, біцепси рук.'
url = 'https://www.youtube.com/watch?v=Wg7ZAoWhcEU'
ex2 = Exercise.create(name: 'Тяга штанги до поясу в нахилі', muscle_group: back, description: des, youtube_url: url)
description = ' Нахиліться, і візьміть гриф штанги верхнім широким хватом (відстань між кистями 60-80см, великі пальці рук дивляться до себе).
 Ноги поставте трохи ширше за плечі, трохи зігніть їх в колінах, корпус намагайтеся тримати паралельно підлозі.
 У будь-якому випадку не розслабляйте м’язи попереку, не горбте спину, тримайте її прогнутою в поперековому відділі під прямим кутом до ніг.
 Допустимі рухи в попереку вгору і вниз не більше 10 градусів.
 Дивитеся не вниз під ноги, а на протилежну стіну, таким чином, ви забезпечите собі правильне положення хребта.
 З цього положення починайте тягнути штангу вгору у напрямку до нижньої частини живота.
 Стежте за ліктями: вони не повинні відходити в сторони від корпусу, що станеться, якщо ви почнете тягнути штангу до грудей.
 Тримайте лікті як можна ближче до тулуба, торкайтеся ними боків при русі штанги вгору.
 У верхній точці обов’язково зробіть невелику паузу, а потім повільно опускайте штангу, але не паралельно ногам, а під невеликим кутом до них, по кривій траєкторії.
 У нижній точці руки повністю витягнуті, найширші м’язи спини повністю розтягнуті.
 При підйомі штанги робіть глибокий вдих, при опусканні - видихайте.'
ex2.steps(description)


des = 'Використовуйте вправу тягу т штанги для максимального опрацювання м’язів спини, оскільки саме воно, в сукупності з тягою звичайною штангою в нахилі, забезпечує максимальною ріст найширших м’язів, і збільшення їх розміру і товщину за дуже невеликий проміжок часу.
Основні працюючі м’язи: найширші спини, великі і малі ромбовидні, трапецієвидні.
Допоміжні м’язи: біцепси рук, дельтовидні (передні пучки)
Для вправи потрібна Т-штанга, яка є штангою з укріпленою посередині поперечною рукояттю. Одна половина штанги рухливо закріплена на підлозі, а інша половина має ручку за яку і піднімаеться. У комплект також зазвичай входить стійка-підставка для ніг, що дозволяє опустити гриф набагато нижче, до рівня його ступень.'
url = ''
ex3 = Exercise.create(name: 'Тяга Т-грифа', muscle_group: back, description: des, youtube_url: url)
description = 'Встаньте на стійку для ніг, зігніться в попереку, руками міцно обхопіть поперечну рукоятку тренажера верхнім хватом, ноги трохи зігніть в колінах, таз прогніть назад.
 Утримуючи спину прямо, починайте тягнути гриф вгору, намагаючись привести рукоятку до низу живота.
 Під час згинання рук не давайте ліктям "гуляти" в сторони, намагайтеся притискати їх до корпусу.
 Торкнувшись рукояттю живота, затримайтеся на дві-три секунди, спробуйте ще більше напружити м’язи спини, звести лопатки одну з одною.
 Після цього повільно і без ривків опускайте гриф, але не ложіть його на опору, а затримайте на відстані декількох сантиметрів від неї.'
ex3.steps(description)


des = 'Вправа тяга гантелі до поясу в нахилі однією рукою призначена для розвитку найширших м’язів, і надання спині ширини і масивності.
Основні м’язи, задіяні у вправі : найширші м’язи спини, м’язи верху спини.
Допоміжні м’язи: біцепси рук, задні пучки дельтовидних м’язів, м’язи предпліч (оскільки довго доводиться утримувати однією рукою вантаж)
Для цієї вправи вам знадобиться: розбірна або лита гантель, і звичайна лавка (необов’язково, оскільки вправу можна виконувати і з упором на коліно)
Варіанти виконання : по-перше, можна розмістити одно коліно, наприклад праве, на лавці, правою рукою спертися на неї, і виконувати тягу по черзі лівою і правою рукою, кожного разу міняючи відповідне коліно.
По-друге, можна спертися однією рукою об спинку лавки, але залишити ногу на підлозі, і виконувати тягу з цієї позиції.
Ще один варіант виконання - не використовувати лавку взагалі. В цьому випадку просто спирайтеся ліктем на своє власне коліно, а іншою рукою робіть тягу, що дуже підходить для тренувань в обмежених умовах.'
url = ''
ex4 = Exercise.create(name: 'Тяга гантелі до поясу в нахилі', muscle_group: back, description: des, youtube_url: url)
description = 'Візьміть гантель однією рукою хватом "в замок" і починайте тягнути її у напрямку до стегна.
 Лікоть під час вправи повинен увесь час як би "ковзати" уздовж спини, уникайте будь-якого його відхилення убік!
 У нижній фазі руху рука трохи подається вперед, а потім зусиллям найширшого м’язу спини приводиться до тазу.
 Перші декілька секунд рука випрямлена в ліктьовому суглобі, а потім поступово, у міру наближення до тазу, вона згинається до кута приблизно в 90 градусів.'
ex4.steps(description)


des = 'Вправа підтягування на турніку широким хватом дуже ефективно помагає для розвитку найширших м’язів спини, а також великих і малих ромбовидних м’язів. Особливо якщо виконувати вправу, взявшись за спеціальну перекладину паралельним хватом кистей, в роботу залучається і біцепс. При підтягуванні за голову задіюються і дельтовидні м’язи, особливо задні пучки. Включайте цю вправу у свій тренувальну програму, і через декілька місяців ви помітите, що спина получила форму "трикутника", стала сильнішою, на ній з’явилися м’язові "горби".
Одна із кращих при роботі над спиною, ця вправа по праву вважається основною, як для початківців, так і для досвідчених атлетів.
Варіанти виконання : підтягування можна виконувати як до торкання перекладиною грудей, так і за голову, причому другий варіант вважається важчим, і додатково задіює в роботу дельтовидні м’язи і біцепси.'
url = ''
ex5 = Exercise.create(name: 'Підтягування до перекладини широким хватом', muscle_group: back, description: des, youtube_url: url)
description = 'Міцно вхопіться за перекладину обома руками верхнім, або прямим, хватом, зігніть ноги в колінах, і починайте виконувати вправу.
 Починайте рух тільки за рахунок м’язів спини, а не рук, не допускайте розгойдування тулуба.
 При підйомі вгору стежте за тим, щоб лопатки сходилися у верхньому положенні, а підборіддя або торкалося перекладини, або було б трохи вище неї.
 При русі вниз руки мають бути повністю випрямлені.
 У початковому положенні робіть вдих, піднімаючись до перекладини - видих.'
ex5.steps(description)


des = 'Підтягування вузьким хватом є різновидом звичайних підтягувань на турніку, але спрямовані в першу чергу не на верхні, а на нижні ділянки найширших м’язів, і на м’язи, що знаходяться ближче до хребта. Працюють при цьому і передні зубчасті м’язи - саме ті, які видно між грудьми і спиною у вигляді паралельних смужок при піднятій руці. Як і стандартні підтягування, вони допоможуть зробити спину ширшою, нададуть масивність, нижньої частини "крил".
Основні задіяні м’язи: найширші, ромбовидні м’язи, великий круглий м’яз, передні зубчасті м’язи.
Допоміжні: біцепси, велика і мала грудні м’язи.
Варіанти: підтягуватися можна, як на звичайній перекладині, взявшись за неї хватом повужчим згори або знизу, так і поклавши на неї скріплені один з одним D -подібної рукоятки. Також можна спробувати використовувати близько розташовані один до одного паралельні бруси, закріпивши їх вище.'
url = ''
ex6 = Exercise.create(name: 'Підтягування до перекладини вузьким хватом', muscle_group: back, description: des, youtube_url: url)
description = 'Підніміть перекладину до висоти, що перевищує ваш ріст мінімум на 10 см, підстрибніть і вхопіться за неї.
 Відстань між кистями 20-25 см.
 Долоні повернені від себе, тоді навантаження переважно лягає на спину, або до себе, що дає більше навантаження на біцепс.
 Отже, в нижній точці ви висите, міцно тримаючись перекладини руками, намагаючись розтягнути м’язи спини своєю вагою.
 Вдихнувши, силою найширших м’язів підніміть своє тіло вгору.
 Торкнутися перекладини грудьми при такому хватові досить проблематично, так що можете завершувати підйом, доторкнувшись до неї підборіддям.
 Під час підйому тримайте лікті в одному і тому ж положенні, щільніше притискаючи їх до боків.
 Досягнувши верхньої точки, видихніть, а потім повільно опустіться вниз, розгинаючи руки в ліктях. '
ex6.steps(description)


des = 'Тяга до грудей верхнього блоку сидячи ця додаткова вправа для розвитку м’язів спини, застосовується вона звичайно в комплексі з іншими, базовими вправами для цієї групи м’язів, наприклад, тягою штанги до поясу в нахилі, або для поліпшення результатів в підтягуванні. Вправа дуже підходить недостатньо сильним, початковим спортсменам, які ще доки не можуть технічно правильно виконати підтягування необхідна кількість разів. До того ж, ризик отримання травми тут зведений до мінімуму.
При виконанні цієї вправи широким хватом в роботу включаються: найширші м’язи спини, особливо їх зовнішні ділянки, а також трапецієвидний м’яз, ромбовидні м’язи, м’язи плечового поясу і біцепси рук. Варто звернути увагу на ширину хвата - чим вона менша, тим більше задіяні серединні частини щонайширших м’язів, і ромбовидні м’язи.'
url = ''
ex7 = Exercise.create(name: 'Тяга до грудей верхнього блоку сидячи', muscle_group: back, description: des, youtube_url: url)
description = 'Відрегулюйте потрібну вам вагу на тренажері, висоту опору для колін.
 Потім, стоячи, візьміться за перекладину тренажера, верхнім хватом кистей, оскільки при використанні нижнього хвата починають надмірно напружуватися біцепси.
 Використовувати закритого, або відкритого хвата - вирішувати вам, тут немає принципової різниці.
 При необхідності використовуйте спеціальні ремені для кистей.
 Після того, як ви міцно захопили рукоятку, повільно і без ривків тягніть її до грудей.
 Стежте за тим, щоб працювали тільки м’язами спини, а не рук!
 В той момент, як ви притягнули рукоятку блоку до грудей, затримайтеся на декілька секунд, і повільно відпускайте її назад.
 Робіть вдих у той момент, коли руки розпрямлені, і видих - коли руки рухаються вниз. '
ex7.steps(description)


des = 'Вправа тяга блоку за голову сидячи дуже схоже на тягу блоку до грудей, з різницею лише, що виконувати її важче. Вона задіює не лише найширші м’язи спини, але і задні пучки дельтовидних м’язів, трапецієвидні м’язи, і більшою мірою біцепси. Сама ця вправа є ізолюючою, і спрямована в першу чергу на надання форми спині. При регулярних заняттях вона допоможе створити спину характерної V -подібної форми. Використовуйте його в комплексі з іншиии базовими вправами, наприклад, тягою Т-штанги в нахилі, або тягою гантелі до поясу. Так ви набагато якісніше і сильніше пропрацюєте усі м’язи своєї спини.'
url = ''
ex8 = Exercise.create(name: 'Тяга за голову верхнього блоку сидячи', muscle_group: back, description: des, youtube_url: url)
description = 'Виставіть на тренажері необхідний вам вантаж, зафіксуйте опору для колін на такій висоті, як вам необхідно.
 Стоячи, візьміться двома руками за рукоятку троса, потім опускайтесь на сидіння.
 Не використовуйте занадто широкого хвата, оскільки в цій вправі він дуже незручний.
 Використовуйте такий хват, щоб в нижній точці передпліччя було перпендикулярне рукоятці.
 Зробіть вдих, і починайте тягнути рукоятку вниз, за голову, причому зверніть увагу на те, щоб руки рухалися в площині тіла, а лікті не відхилялися назад.
 Спина має бути прогнута в попереку для створення максимальної напруги, голова трохи нахилена вперед.
 Тягніть рукоятку до тих пір, поки не відчуєте, що вона торкнулася потилиці.
 Потім затримайтеся в такому положенні на дві-три секунди, зробіть видих, і розгинайте руки з рукояткою до тих пір, поки не повернетеся у вихідне положення.'
ex8.steps(description)


des = ''
url = ''
ex9 = Exercise.create(name: 'Тяга горизонтального блоку до живота сидячи', muscle_group: back, description: des, youtube_url: url)
description = 'Візьміться за рукоятки, сядьте перед тренажером, долаючи напругу троса, ноги поставте в спеціальну опору, коліна тримайте трохи зігнутими.
 Тепер відхиляйтеся назад, поки корпус не стане перпендикулярний підлозі.
 Постарайтеся утримувати таке положення під час усієї вправи.
 Глибоко вдихніть, і на вдиху повільно тягніть рукоятку тренажера до живота, до торкання його великими пальцями.
 Лікті при цьому плавно рухаються біля корпусу, в кінцевій фазі руху вони як найдалі відведені назад, а лопатки мають бути зведені.
 Затримайтеся так на деякий час, а потім на видиху відпускайте рукоятку тренажера, корпус при цьому постарайтеся не згинати.
 При виконанні вправи постарайтеся не розгойдувати корпус вперед-назад, оскільки це знімає частину навантаження з найширших м’язів, і надмірно навантажує м’язи попереку.'
ex9.steps(description)


des = 'Вправа тяга блоку до живота сидячи допомагає надати форми найширшим м’язам спини, зробити їх опуклими, чіткими. По своїй біомеханіці і кількості м’язів, що включаються в роботу, воно дуже нагадує веслування на весловому човні.
Основні задіяні м’язи: найширші м’язи спини (особливо їх нижніх частин), ромбовидні м’язи (великі і малі), трапецієвидні м’язи (особливо середня частина).
Допоміжні м’язи: великі грудні м’язи, біцепси і тріцепси рук.
Для виконання вправи потрібний звичайний тросовий тренажер з нижнім блоком.
Ви можете використовувати стандартну довгу пряму рукоятку, або дві D -подібні рукоятки, скріплені разом. У першому випадку ви зможете легко змінювати ширину хвата, в другому - це буде скрутно.'
url = ''
ex10 = Exercise.create(name: 'Шраги зі штангою', muscle_group: back, description: des, youtube_url: url)
description = 'Спочатку вам необхідно підняти штангу до рівня верхньої третини стегон.
 Ви стоїте з штангою в опущених вниз руках, ноги га ширині плечей.
 З цього положення починайте тягнути штангу вгору, причому стежите, щоб тяга виконувалася за рахунок трапецієвидного м’яза, а не рук, тому руки мають бути постійно випрямлені в ліктьових суглобах.
 Підніміть плечі так високо, як зможете, а потім повільно починайте опускати їх вниз.
  Коли ви опускаєте вантаж, постійно тримайте м’язи в напрузі, не давайте штанзі "висмикувати" ваші руки з плечових суглобів. '
ex10.steps(description)


des = 'Підйом плечей з гантелями по техніці виконання і ефекту, що робиться,похоже на шрагі з штангою, власне, ці дві вправи практично невідмінні одна від одної, і спрямовані на розвиток трапецієвидного м’яза. Їх відмінність в тому, що шрагі з гантелями виконати легше, оскільки ваги в цій вправі зазвичай виставляються менші - як це не парадоксально, дві гантелі, які в сумі важать стільки ж, скільки і штанга, утримати в руках складніше.
Вам знадобляться дві гантелі або дві гирі потрібної вам ваги. Гантелі можна використовувати, як розбірні, так і литі. Обов’язково одягніть атлетичний пояс, інакше можна травмувати поперек. За бажанням закріпіть пальці рук на грифах гантелей за допомогою кистьових ременів.'
url = ''
ex11 = Exercise.create(name: 'Шраги з гантелями', muscle_group: back, description: des, youtube_url: url)
description = 'Початкове положення - стоячи, ноги розтавте трохи вужче за плечі.
 Нагніться, і міцно обхопіть гриф кожної гантелі пальцями, потім, утримуючи спину у випрямленому положенні, підніміть їх до верхньої третини стегна.
 Ви можете тримати гантелі, як перед собою, так і з боків, як вам буде зручніше - це не впливає на результат.
 Тепер тягніть руки з гантелями вгору і трохи назад, стежачи за тим, щоб вони не згиналися в ліктях.
 Виконуйте тягу за рахунок сили одного тільки трапецієвидного м’яза, якщо відчуваєте, що не можете зробити вправу правильно і технічно, візьміть легші гантелі - ця вага вам занадто велика.
 Опускайте вагу повільно, спокійно. '
ex11.steps(description)

#-------------------Chest------------------------->

des = 'Ця вправа жим штанги лежачи сприяє розвитку, великого і малого грудного м’яза, а також тріцепсів, дельтовидного м’яза, і розвитку зубчастих і дзьобовидно-плечових м’язів.
На горизонтальну лавку слід лягти спиною, щільно притиснувши сідниці до лавки, ноги необхідно поставити супнею на підлогу
- необхідно хватом згори узяти гриф штанги на відстані трохи ширше плечей;
- потім зробити глибокий вдох і приступити до повільного опускання штанги до рівня грудей, намагаючись контролювати кожен рух;
- здійснюється перехід до утиснення штанги і після закінчення цього руху необхідно видихнути.'
url = ''
ex20 = Exercise.create(name: 'Жим штанги лежачи', muscle_group: chest, description: des, youtube_url: url)
description = 'Лягти на лаву, притиснувши до неї голову, плечі і сідниці.
Поперек трохи прогнути, ноги розташувати ширше плечей, уперши ступні в підлогу.
Взятися за штангу широким хватом, зняти її з упорів і підняти у верхню точку над серединою грудей.
Глибоко вдихнувши, опустити штангу в нижню точку до легкого торкання грудей, зафіксувати подих.
Вижати штангу вгору до вихідного положення, зробивши потужний видих ближче до кінцевої точки.
У кінцевій точці витримати невелику паузу і максимально напружити груди.'
ex20.steps(description)


des = 'Ця базова вправа жим штанги на лавці вниз головою для збільшення сили і об’єму м’язів нижньої частини грудей. Воно не лише збільшує силу і об’єм ваших м’язів, але і достатньою мірою навантажує тріцепси, дельтовидні м’язи, зокрема передню і середню частини, а також і передніх зубчастих м’язів (це м’язи, розташовані з боків грудей, прилеглі до пахв).'
url = ''
ex21 = Exercise.create(name: 'Жим штанги на похилій лаві', muscle_group: chest, description: des, youtube_url: url)
description = 'Візьміть штангу середнім або широким хватом та зніміть її з опорів.
Початковим положенням є упор штанги на витягнутих руках.
Вправа ділиться на дві фази: вдих - опускання штанги, видих - підняття.
Рух виконується без ривків і зупинок, плавно.
Можлива фіксація руху (зупинка на 1 або 2 секунди) в початковому положенні.'
ex21.steps(description)


des = 'Ця вправа віджимання на брусах призначена для розвитку мускулатури грудей, плечового поясу, і тріцепсів. По мірі навантаження, застосованого до м’яза, цю вправу можна вважати базовою. Крім того, вона не вимагає використання додаткових вагів, займатися можна зі своїм тілом, нічого більшого не маючи.
М’язи, що включаються в роботу : великий грудний м’яз (особливо нижні пучки), дельтовидні м’язи, тріцепси'
url = ''
ex22 = Exercise.create(name: 'Віджимання на брусах', muscle_group: chest, description: des, youtube_url: url)
description = 'Прийміть початкове положення в упорі на брусах, причому руки мають бути випрямленими в ліктях, і починайте виконувати вправу з цього положення.
Трохи нахиліть корпус вперед, а потім не кваплячись опустіться, зігнувши руки в ліктях до прямого кута.
Не падайте різко вниз, інакше дія від вправи на м’язи помітно знизиться, і виникне ризик травми.
Затримайтеся в нижній точці на декілька секунд, відчуйте, як розтягуються ваші м’язи, потім плавно і повільно підніміться в початкове положення.
При опусканні робіть вдих, при підйомі вгору - видих.'
ex22.steps(description)


des = 'Для зміцнення грудних м’язів і м’язів верхнього плечового поясу немає краще за вправу, ніж жим, лежачи - штанги або гантелей, в горизонтальному або похилому положенні. Ця прекрасна вправа сприяє не лише нарощуванню м’язової маси і зміцненню тканин м’язів, але і виразно промальовує рельєф, розділяючи груди. Найбільш явно це помітно, коли гантелі стикаються в самій верхній точці амплітуди.'
url = ''
ex23 = Exercise.create(name: 'Жим гантелей лежачи', muscle_group: chest, description: des, youtube_url: url)
description = 'Лежачи на горизонтальній лаві, тримайте гантелі прямим хватом на зігнутих руках на ширині плечей на рівні грудей.
Кут зігнутих рук повинен становити 90 градусів - це початкове положення.
На видиху тисніть гантелі вертикально вгору, повністю випремляючи руки.
Щоб надати максимальне навантаження на грудні м’язи, зводьте гантелі разом при випрямленні рук.
Не поспішайте опускати гантелі, потримайте близько секунди.
В ідеалі, опускання ваги повинне займати вдвічі більше часу, ніж його підняття.
Опустіть гантелі якнайнижче і розведіть лікті в сторони, розтягуючи грудні м’язи.'
ex23.steps(description)


des = 'Жим гантелей лежачи на лавці під кутом ця вправа є додатковою при роботі на м’язи грудей, а при виконанні на похилій лавці, підведеній догори, ефект зміщується на верхні пучки великого грудного м’яза, дельтовидні м’язи (особливо передні пучки), і також тріцепси. У цієї вправи є як плюси, так і мінуси в порівнянні з жимом штанги лежачи. Виконувати його дещо важче, ніж жим штанги, оскільки гантелі, іноді досить великої ваги, доводиться піднімати з підлоги на рівень грудей, а крім того, положення променезап’ясткових і ліктьових суглобів не фіксоване грифом штанги, лікті можуть "роз’їжджатися", через що можливі травми! Плюси ж - це можливість опустити гантелі нижче, ніж штангу, якій заважає гриф, завдяки чому грудні м’язи розтягуються набагато сильніше.'
url = ''
ex24= Exercise.create(name: 'Жим гантелей лежачи під кутом', muscle_group: chest, description: des, youtube_url: url)
description = 'Сидячи на похилій лавці, ви берете гантелі в обидві руки, хватом "в замок", згинаєте руки в ліктьових суглобах, неначе робите підйом на біцепс, і одночасно рухом усього корпусу назад з невеликим прогином в попереку закидайте гантелі до плечей.
Потім опускайтеся на похилу лавку і власне починаєте жим.
Під час виконання жиму дивіться за тим, щоб руки з гантелями не роз’їжджалися в сторони, але також стежте і за тим, щоб не притискати руки до корпусу.
Тисніть гантелі одночасно, не допускайте, щоб одна з них була вища або нижча, при опусканні гантелей кут в ліктьовому суглобі має бути близько 90 градусів.
Спробуйте тримати гантелі паралельно одну одній на початку виконання вправи, коли вони знаходяться у грудей, і, виконуючи пронацію кистей і передплічь, тримати їх так само, як ви тримаєте гриф штанги.'
ex24.steps(description)


des = 'Розводки гантелей лежачи проста і ефективна вправа для розвитку великих грудних м’язів, а завершальна фаза вправи розвиває і тріцепс. Виконується в похилому і горизонтальному лежачи. Висота лавки має бути підібрана таким чином, що б стегна розташовувалися, паралельно підлозі і не було зайвого вигину спини, що може викликати додаткове навантаження на поперек. Якщо лавка не регулюється по висоті, то покладіть під ноги підставки (диски). Ширина лавки має бути такою, щоб не утрудняти рух плечей. '
url = ''
ex25= Exercise.create(name: 'Розведення гантелей лежачи', muscle_group: chest, description: des, youtube_url: url)
description = 'Сядьте на лавку, візьміть гантелі в руки і покладіть їх на стегна, опускаючи спину на лавку, одночасно піднімаючи руки над собою, тримаючи їх злегка зігнутими, щоб зменшити навантаження на ліктьовий суглоб.
Важливо: не тримати гантелі над головою, тільки в площині грудей.
Ноги мають бути зігнуті під прямим кутом, ступні притиснуті до підлоги.
На вдиху розводьте руки в сторони до рівня плечей, як і раніше тримаючи їх в площині грудей.
Болю або дискомфорту при цьому виникати не повинно, опускайте гантелі, поки вистачає гнучкості.
У нижній точці не розслаблятися, це може привести до травми.
Зробіть паузу в нижній точці, потім на видиху підніміть гантелі по тій же траєкторії.'
ex25.steps(description)


des = 'Тренажер метелик (батерфляй) застосовується для загального розвитку м’язів грудей. Він складається з лавки, розділеної на дві частини : спинку і сидіння і робочих областей для рук, які через тросово-роликову систему приводять в рух вантаж, що складається з набору прямокутних плит.'
url = ''
ex26= Exercise.create(name: 'Зведення рук в тренажері "Метелик"', muscle_group: chest, description: des, youtube_url: url)
description = 'Сядьте на лавку і займіть правильне положення: спина щільно притиснута до спинки, ноги торкаються підлоги, лопатки зведені, груди випнуті вперед, при необхідності відрегулюйте висоту сидіння.
Візьміться за рукоятки або упріться долонями в подушечок, таким чином, щоб передпліччя утворили прямий кут з плечима і знаходилися з ними в одній площині.
Саме виконання цих умов дозволяє тренувати м’язи грудей, а не рук.
На вдиху повільно зведіть руки, так щоб зіткнулися подушечки, створюючи зусилля виключно ліктями, а не кистями.
Роблячи видих, так само повільно, контролюючи швидкість, розведіть руки.'
ex26.steps(description)


des = 'Ця вправа кросовер - зведення рук на блокових тренажерах є ізолюючою, цілеспрямовано розвиває внутрішні і нижні пучки грудних м’язів, а другорядне навантаження лягає на дельтовидні м’язи і тріцепси. Виконується зазвичай на додаток до жиму штанги або гантелей лежачи, або до іншої базової вправи для м’язів грудей.'
url = ''
ex27= Exercise.create(name: 'Зведення рук у кросовері', muscle_group: chest, description: des, youtube_url: url)
description = 'Встаньте між двома блоковими пристроями, візьміться за рукояті тросів, руки розведіть в сторони.
Потім зробіть невеликий крок вперед, і трохи висуньтеся за площину тренажера.
Одну ногу можна виставити вперед для більшої стійкості.
Трохи прогніть спину вперед, і починайте зводити руки приблизно до рівня середини стегна, потім зупиниіться на пару секунд, і ще більше напружте грудні м’язи.
Потім повільно верніться до початкового положення, але не кидайте вантаж різко, інакше можливі травми!
При опусканні рук вниз робіть видих, при русі вгору - вдох, під час підходу постійно тримайте руки зігнутими в ліктьових суглобах, а м’язи грудей - в напрузі.
 Закінчуючи вправу, акуратно відпускайте рукоятки тросів, спочатку один, потім інший.'
ex27.steps(description)


des = 'Пуловер з гантелею є допоміжна вправа, спрямована в першу чергу на зміцнення найширших м’язів спини, грудних м’язів, а також в деякій мірі тріцепсів. Вправа застосовується не як самостійне, а в якості додаткового при роботі над м’язами грудей.'
url = ''
ex28= Exercise.create(name: 'Пуловер з гантелею', muscle_group: chest, description: des, youtube_url: url)
description = 'Візьміть гантель достатньої ваги, обома руками, і підніміть її до рівня грудей.
Потім плавно опускайтеся на лавку, руки з гантеллю витягніть перед собою.
Ноги поставте широко і стійко, потім, утримуючи гантель за один кінець, візьміться так, щоб чотири пальці охоплювали гантель над грифом, і великі пальці - під грифом.
Отже, гантель знаходиться прямо над особою, руки трохи зігнуті в ліктях.
Тепер починайте повільно опускати гантель, проносячи її над особою, за голову.
Не опускайте гантель занадто низько, нижче за рівень тулуба, це може привести до травми.
Руки у цей момент постарайтеся тримати прямими.
Затримайтеся на декілька секунд в такому положенні, відчуйте, як розтягуються м’язи спини і грудей, зробіть вдих, а потім підніміть гантель назад, трохи зігнувши руки в ліктях.'
ex28.steps(description)

#-------------------Biceps----------------------->

des = 'Дана вправа дійсно є базовою, на відміну від практично всіх інших вправ на біцепс. Той же підйом штанги на біцепс, підйом гантелей на біцепс/ згинання в лаві скотта, концентрований підйом гантелей на біцепс, це все, для тих, хто не в курсі, про ізолюючі рухи, тобто в них задіюється лише один суглоб (ліктьовий), отже, у цих вправах не так добре (ефективно) скорочуються біцепси, як могли б скорочуватися. Розумієте про , що я пишу? Загалом, ця ексклюзивна вправа, яка називається підтягування зворотнім хватом на біцепс. Вона є базовою (тому що в роботі бере участь не два суглоба, а саме плечовий ш ліктьовий), отже, в даній вправі біцепси скорочуються набагато краще (ефективніше) ніж у всіх інших. '
url = ''
ex30= Exercise.create(name: 'Підтягування зворотнім хватом', muscle_group: biceps, description: des, youtube_url: url)
description = 'Підійдіть до турніка, після чого візьміться середнім зворотнім хватом.
Повисніть на перекладині, таким чином, щоб ваші руки були не повністю випрямлені в нижній точці , а зігнуті (в лікті), щоб вже з нижньої точки руху навантаження припадала на біцепс.
Якщо ви розпрямите руки повністю ви знімите навантаження з біцепсів, і включите в роботу низ спини (широкі).
З цього вихідного положення, починайте підтягуватися вгору (згинаючи руки), дістаючи поперечини підборіддям.
Лікті повинні знаходитися поруч біля корпусу, а не сильно розходитися в сторони.
Повільно під контролем опускайтеся в нижню точку, не випрамляючи руки.'
ex30.steps(description)

des = 'Підйом штанги на біцепс це основна вправа для тренування біцепсів, здатна реально наростити його масу і збільшити силу. Навантаження тут рівномірно падає на обидва пучки біцепса, м’язи внутрішньої поверхні передпліччя, і плечовий м’яз.
Основні задіяні м’язи в вправі: біцепси.
Допоміжні м’язи: плечовий м’яз, плечо променевий м’яз, передпліччя (внутрішня частина).
Міняючи ширину хвата, ви зміщуєте навантаження на різні пучки біцепса. Чим ширше хват, тим більше працюють зовнішні пучки, і навпаки.'
url = ''
ex31= Exercise.create(name: 'Підйом штанги на біцепс', muscle_group: biceps, description: des, youtube_url: url)
description = 'Прийміть таке початкове положення, щоб вже на самому початку відчути навантаження на руки : візьміть гриф штанги звичайним (нижнім) хватом, відхиліться назад, прогнувши спину в попереку.
З цього положення починайте згинати руки в ліктях, намагаючись не рухати ними з одного боку в інший.
Піднімайте штангу у напрямку до грудей, але не повністю, а з частковою амплітудою.
Вгорі зупиніться, намагаючись утримати штангу на частково зігнутих руках.
Постарайтеся відчути усю зростаючу напругу біцепса.
Опускайте руки як можна повільніше, і не до повного розгинання в ліктях, інакше навантаження з біцепса зніметься.
При згинанні рук вдихайте, при розгинанні - видихайте.'
ex31.steps(description)

des = 'Згинання рук в ліктях - основний рух для тренування двоголового м’яза плеча, а при його виконанні зворотним хватом навантаження переважно доводиться на нижні ділянки біцепса, плечовий м’яз, і численні м’язи передньої поверхні передпліччя. Ця вправа спрямована на надання форми тим м’язам, що прилягають до ліктьового суглоба, а у більшості атлетів вони розвинені гірше, ніж інші м’язи рук.'
url = ''
ex32= Exercise.create(name: 'Згинання рук зі штангою зворотнім хватом', muscle_group: biceps, description: des, youtube_url: url)
description = 'Використовуйте штангу з прямим грифом, узявши її хватом згори (великі пальці рук дивляться на підлогу).
Відстань між кистями має бути близько 30-50 см, не більше.
Розпряміть плечі, прийміть правильну осанку, трохи прогніться назад, надайте стійке положення ногам.
Штанга знаходиться внизу на витягнутих руках - це початкове положення.
Під час вдиху повільно підніміть штангу до грудей, згинаючи руки в ліктях.
Утримуйте при цьому лікті щільно притиснутими до корпусу, не рухайте ними вперед або назад.
Щоб зовсім унеможливити рух ліктів, встаньте спиною до стіни, і спробуйте виконати вправу з такого положення.
У верхній точці гриф штанги рухається у напрямку до грудей, але не торкається її, а при опусканні доходить до рівня стегон.'
ex32.steps(description)


des = 'Найголовніше в вправі згинання рук зі штангою на лавці Скотта це повне виключення можливості непотрібних рухів в ліктях, завдяки чому досягається максимальна міра ізольованої роботи біцепса, і, відповідно, застосовується для опрацювання чіткості контурів м’яза, його рельєфу і форми.
Тут можна використовувати будь-який вид хвату - вузький, широкий, або середній. Усе залежить від того, якій ділянці біцепса ви хочете дати максимальне навантаження.'
url = ''
ex33= Exercise.create(name: 'Згинання рук зі штангою на лавці Скотта', muscle_group: biceps, description: des, youtube_url: url)
description = 'Відрегулюйте висоту опори для рук, так, щоб вам було зручно.
Спина має бути прямою, що автоматично надасть стійкість усьому тілу.
Сядьте перед опорую для рук, покладіть на неї руки.
Лікті повинні знаходитися на самому пюпітрі, а не з’їжджати з нього вниз.
Візьміть штангу зі стійок, які знаходяться зазвичай трохи нижче, або попросіть товариша по тренуваннях подати її вам.
Зусиллям біцепсів підніміть штангу у напрямку до підборіддя, згинаючи руки в ліктьових суглобах, але не занадто високо.
Оптимальним, мабуть, буде прямий кут між плечем і передпліччям, вище піднімати штангу не варто, інакше напруга у біцепсах пропаде.
З верхньої точки повільно опустіть гриф вниз, розігнувши руки в ліктях практично до кінця.
Це необхідно для того, щоб повністю навантажити усі ділянки біцепса, у тому числі і ті, які знаходяться внизу, біля ліктя. '
ex33.steps(description)


des = 'Вправа концентрований підйом на біцепс формує, і надає біцепсу щільність, пружність, сприяє збільшенню його розмірів під час максимального скорочення, а саме тому біцепс і набуває характерної "трикутної" форми. Одним словом, якщо ви хочете зробити біцепс красивим, таким, що виразно виділяється, і маєте вже яку-небудь м’язову масу, це вправа для вас!'
url = ''
ex34= Exercise.create(name: 'Концентрований підйом на біцепс', muscle_group: biceps, description: des, youtube_url: url)
description = 'Візьміть гантель, що піходить для вас по вазі, однією рукою, сядьте на край лавки, плечем тієї руки, в якій знаходиться гантель, зіпріться об внутрішню сторону відповідного стегна.
Якщо ж ви вирішили виконувати вправу без опори, то прийміть положення, зігнувшись в попереку під прямим кутом, гантель знаходиться в опущеній руці.
Тепер починайте згинати руку в ліктьовому суглобі, стежте за амплітудою і чіткістю виконання вправи.
Гантель рухається тільки в одній площині, усі рухи в суглобах, окрім ліктьового, виключені.
Привівши руку з гантеллю до протилежного плеча і торкнувшись його, затримайтеся, відчуйте момент максимального скорочення біцепса, і повільно розгинайте руку у зворотному напрямі.
Згинаючи руку, робіть вдих, розгинаючи - видих.'
ex34.steps(description)


des = 'Підйом гантелей на біцепс - прекрасна вправа для розвитку сили і маси біцепса, збільшення об’ємів рук. Ця базова вправа для двоголового м’яза, разом із згинанням рук з штангою, і при постійному спільному виконанні дає відмінний результат. Руки стають товщі і більші, сила їх росте, а біцепс стає масивним і сильним.'
url = ''
ex35= Exercise.create(name: 'Поперемінний підйом гантелей', muscle_group: biceps, description: des, youtube_url: url)
description = 'Сядьте на лавку, обхопіть гриф гантелі кожною рукою хватом "в замок", опустіть їх на витягнутих руках вниз.
Корпус тримайте прямим, уникайте непотрібного скруглення спини в хребті.
Напружте біцепси і зігніть руку в ліктьовому суглобі.
Піднявши, таким чином, гантель до відповідного плеча, без затримки починайте опускати її назад.
Опускайте гантель повільніше, ніж піднімаєте, але у будь-якому випадку, ривків і непотрібного поспіху бути не повинно в обидві фази руху.
Лікті увесь час щільно притиснуті до тулуба, усі рухи здійснюються тільки в ліктьових суглобах, плечі і променезап’ясткові абсолютно статичні.
Зігнувши і розігнувши одну руку, починайте згинати другу, або, якщо хочете попрацювати інтенсивніше, починайте виконувати вправу другою рукою, як тільки перша почала опускатися.'
ex35.steps(description)




#-------------------Triceps----------------------->

des = 'Це хорошаа базова вправа, яка задіює усі пучки тріцепса, віджимання від лавки забезпечує максимальний набір маси і м’язової сили для тріцепса. Тріцепс росте в товщину, набуває значного вигляду, відмінно виглядає - такого важко добитися роботою на блоці, і навіть французький жим тут менш ефективний.'
url = ''
ex40= Exercise.create(name: 'Віджимання від лавки', muscle_group: triceps, description: des, youtube_url: url)
description = 'Зіпріться кистями рук паралельно об край лавки, ноги розмістіть на підлозі, або покладіть їх на іншу лавку так, щоб торкалися її п’ятами і нижньою третьою частини гомілки.
Якщо хочете додати собі навантаження, попросіть кого-небудь покласти вам на стегна диск від штанги.
Випрямивши руки, прийміть положення, при якому таз знаходився за межами лавки, і щоб не заважав виконувати вправу.
Вдихніть і опустіться вниз, повільно згинаючи руки в ліктях.
Коли кут в них стане прямим, на видиху підніміть своє тіло вгору за рахунок скорочення тріцепсів.
Випрямляйте руки повністю, лікті постійно тримайте в одній площині, не рухайте ними в право або вліво.'
ex40.steps(description)


des = 'Незважаючи на свою назву, французький жим лежачи зовсім не є жимом в тому значенні слова, як ми звикли. У цій вправі упор робиться на розгинання рук з використанням відносно невеликих ваг, що і визначає основні його ефекти, якими є надання форми нижнім відділам тріцепса, а потім вже збільшення його розмірів. Тут найінтенсивніше працюють латеральні і серединні пучки, що і визначає ціль застосування цієї вправи у бодібілдінгу - промальовування м’язових волокон, їх деталізація і максимальний розподіл.'
url = ''
ex41= Exercise.create(name: 'Французький жим лежачи', muscle_group: triceps, description: des, youtube_url: url)
description = 'Беремо штангу обома руками, міцно обхоплюємо її гриф верхнім хватом (кисті на відстані власних плечей можна трошки вужче).
Ляжте на лавку, притиснувшись до неї потилицею, лопатками, сідничними м’язами.
Міцно упираючись ступнями в підлогу, прийміть як можна стійкіше положення.
Штанга знаходиться вгорі на повністю витягнутих руках.
Уникаючи рухів в плечових суглобах, повільно опустіть гриф штанги вниз і назад, у напрямку до власного лоба, і зафіксуйте вагу в такому положенні на декілька секунд.
Стежте за тим, щоб кут між передпліччям і плечем був прямим.
Після паузи підніміть штангу в початкове положення, діючи тільки силою тріцепсів.
Після того, як штанга знову стане в верхне положення (вгорі) на випрямлених руках, без затримки опускайте її знову.
Вдих робіть при опусканні штанги вниз, видих - при її підйомі.'
ex41.steps(description)


des = 'Вправа французький жим сидячи, дуже ефективна для качання тріцепсів, а вони, як відомо, складають дві третини від загального об’єму плечових відділів рук. Виконувати французький жим рекомендується в положення сидячи на лавці з низькою спинкою. '
url = ''
ex42= Exercise.create(name: 'Французький жим сидячи', muscle_group: triceps, description: des, youtube_url: url)
description = 'Використовуйте для французького жиму ЕZ –гриф, це дозволить кистям розташувати під таким кутом, який зробить на них найменший тиск.
Сидячи на лавці з низькою спинкою, щільно притисніться до неї свою спину.
ЕZ -гриф візьміть хватом згори, підніміть його над головою.
Утримуючи плечовий відділ перпендикулярно підлозі, згинайте руки, стежачи за рухом грифа за голову і назад.
Опускати гриф слід як найнижче за голову.
Не варто розслабляти лікті у верхній точці амплітуди, оскільки, по-перше, це дає можливість відпочити вашим м’язам, а, по-друге, може привести до болю в ліктьовому суглобі або запалення.'
ex42.steps(description)


des = 'Вправа розгинання рук на верхньому блоці стоячи спрямована на качання тріцепса, ця вправа є повністю ізолюючою, дає основне навантаження тільки на латеральний пучок тріцепса. Саме вона добре помітна на зовнішній стороні плеча при погляді на людину спереду. Основне призначення цієї вправи - надання рельєфу і форми.'
url = ''
ex43= Exercise.create(name: 'Розгинання рук на верхньому блоці стоячи', muscle_group: triceps, description: des, youtube_url: url)
description = 'Підійдіть до тренажера так, щоб робоча рука опинилася в одній площині з його тросом, однойменною ногою декілька відступите назад, щоб не заважати собі під час розгинання руки.
Однією рукою тримаєтеся за станину тренажера, а іншою візьміть рукоять нижнім хватом, щоб долоня і великий палець були спрямовані у вашу сторону, потім, зігнувши руку і привівши лікоть до тулуба, натягніть трос і підведіть вантажі над упорами.
Вдихніть, і на затримці дихання потягніть рукоять вниз, розгинаючи руку в ліктьовому суглобі.
До кінця випрямивши руку, видихніть, і, після нетривалої паузи починайте згинати руку у зворотному напрямі.
Під час негативної фази не дозволяйте вантажу тягнути вашу руку, чиніть опір, намагайтеся прикласти максимум зусиль для того, щоб утримати рукоять.
Зрозуміло, негативна фаза повинна тривати як мінімум в два рази довше за позитивну.
Виконавши усі заплановані повторення однією рукою, оберніться до блоку іншою стороною і повторіть усе знову.'
ex43.steps(description)

des = 'Розгинання руки із за голови з гантеллю у бодібілдінгу ця ізолююча вправа застосовується для опрацювання рельєфу тріцепса, роздільного тренування правої або лівої руки, якщо одна з них відстає. Основне навантаження тут доводиться на верхню і середню частини тріцепса, що і призводить до їх видимого відмежування один від одного, чіткого промальовування контурів усіх основних пучків.'
url = ''
ex44 = Exercise.create(name: 'Розгинання руки із-за голови з гантеллю', muscle_group: triceps, description: des, youtube_url: url)
description = 'Сядьте на край лавки, прийміть стійке положення, міцно упріться ступнями в підлогу.
Візьміться за гриф гантелі тією рукою, яку маєте намір качати, витягніть її над головою так, щоб лікоть був розігнутий.
Хват гантелі нейтральний - долоня і великий палець повернені у бік власного тіла.
Корпус прямий, спина злегка прогнута в попереку.
Зробивши вдих, опускайте з цього положення гантель за голову, стежачи за відсутністю рухів в плечовому суглобі, якщо ж, особливо на перших порах, важко цього уникнути, притримуйте лікоть іншою рукою.
Гантель опускається вниз або по прямій (до відповідного плеча), або по злегка викривленій (до хребта) траєкторії.
Вдих бажано робити у момент згинання руки з тим, що обтяжило, видих, навпаки, у момент її розгинання.
У нижній точці в паузі немає необхідності, досягнувши її, відразу ж розгинайте руку назад, до повного розпрямлення в ліктьовому суглобі.
Ось у цей момент бажано зупинитися і ще сильніше напружити відповідні м’язи, потім знову зробити згинання руки в лікті до тих пір, поки тріцепс немов би "задерев’яніє".
Повністю попрацювавши над однією рукою, переходите до іншої.'
ex44.steps(description)

#-------------------Shoulders-------------------->

des = 'Тяга штанги до підборіддя стоячи це прекрасна формувальна вправа для трапецієвидних м’язів, до того ж сприяє чіткому промальовуванню контура між дельтовидними м’язами і трапеціями. Цей вид тяги сприяє виділенню трапецій, детальному промальовуванню їх контурів.
Основні працюючі м’язи: трапецієвидний м’яз, середні пучки дельтовидного м’яза, м’язи, що піднімають лопатку.
Допоміжні: біцепси плеча, передні пучки дельтовидного м’яза, верхні пучки великого грудного м’яза.'
url = ''
ex50 = Exercise.create(name: 'Тяга штанги до підборіддя', muscle_group: shoulders, description: des, youtube_url: url)
description = 'Візьміть штангу з прямим грифом верхнім хватом, відстань між кистями рук повинна складати близько 20 см.
Початкове положення: стоячи, ноги трохи вужче за ширину плечей, штанга в опущених руках на рівні верхньої третини стегна, спина пряма, трохи розігнута назад.
З цього положення, зробивши вдих, повільно тягніть штангу вгору, до торкання її підборіддя.
Дивіться за тим, щоб підйом ваги здійснювався за рахунок напруги дельтовидних і трапецієвидних м1язів, а не за рахунок рук.
У верхній фазі руху штанга фіксована підборіддям, лікті розлучені і дивляться вгору.
Зробіть видих, затримайтеся на декілька секунд, максимально напружте трапеції і дельтовидні м`язи, а потім повільно опускайте штангу вниз, в початкове положення.'
ex50.steps(description)


des = 'Вправа жим гантелей сидячи призначена для опрацювання м’язів плечового поясу в добавок до жимів зі штангою або самостійно. Це базова вправа для нарощування маси, об’ємів, і збільшення сили дельтовидних м’язів, надання їм характерної форми. Жим з гантелями має одну перевагу перед жимом штанги : амплітуда тут більше, і гантелі рухаються по дузі, що дозволяє додатково пропрацювати глибокі пучки дельт.
Основні задіяні м’язи : дельтовидні (передні і середні пучки), тріцепси.
Допоміжні: трапецієвидні м’язи, м’язи лопатки.
Вправу можна виконувати сидячи на звичайній лавці, лавці з підтримувальною спинкою (самий кращий варіант), або навіть на простому стільці - головне, щоб він був міцно закріплений і не хитався.'
url = ''
ex51 = Exercise.create(name: 'Жим гантелей сидячи', muscle_group: shoulders, description: des, youtube_url: url)
description = 'Підберіть необхідні гантелі, сядьте, і підніміть їх до рівня ключиць, великі пальці рук при цьому спрямовані до зовні, кисті з гантелями (повернені до себе).
Хребет випрямлений, лікті знаходяться в площині тіла.
На вдиху зусиллям дельтовидних м`язів підніміть руки з гантелями вгору, стежте, щоб вони рухалися тільки у фронтальній площині, а лікті не відхилялися назад.
Тисніть гантелі по дузі, у верхній точці вони практично стикаються один з одним, але не до зіткнення.
Плечі підведені, а руки і вгорі мають бути частково зігнуті в ліктях; не розгинайте їх повністю.
Затримавшись у верхній точці, починайте опускати руки вниз, рухаючись у зворотному напрямі по тій же траєкторії.
Потім приступайте до наступного повтору.'
ex51.steps(description)


des = 'Відмінна, ефективна, потужна вправа жим штанги стоячи для тотального опрацювання усіх м’язів верхнього плечового поясу і тріцепсів. При його виконанні рівномірно задіюються усі пучки дельтовидних м’язів, що з часом надає їм потужність і силу, сприяє максимальному росту м’язової маси і об’ємів. Цей природний у своїй простоті рух використовується і важкоатлетами, і пауерліфтерами, і бодибилдерами, причому з приголомшливим успіхом. Ви можете не робити тяги до підборіддя або розведення рук з гантелями, а маса і сила всерівно відмінно ростимуть, якщо ви доповните свої тренування такою чудовою вправою.'
url = ''
ex52 = Exercise.create(name: 'Жим штанги стоячи', muscle_group: shoulders,description: des, youtube_url: url)
description = 'Підійдіть до штанги, візьміться за гриф верхнім хватом, причому не дуже широким, міцно зафіксуйте його.
Потім, зігнувши ноги в колінах і тазостегнових суглобах, сядьте перед штангою так, щоб її гриф торкався ваших гомілок.
Піднявши вагу до рівня стегон, спільним зусиллям м1язів спини і рук підніміть снаряд до грудей - це буде початковим положенням для виконання вправи.
Тепер зробіть глибокий вдих, і, доклавши максимально зусилля для тріцепсів і дельтовидних м`язів, підніміть штангу вгору на витянуті руки.
Зафіксуйте її над головою впродовж двох - трьох секунд на випрямлених руках, і як можна сильніше напружте тріцепси і дельти, а потім повільно опускайте в початкове положення.'
ex52.steps(description)


des = 'Серйозна базова вправа жим штанги з за голови , що включає в роботу величезну кількість м’язових груп, що збільшує силу і масу м’язів плечового поясу і рук, вона відмінно доповнює армійський жим, робить тренування дельт різноманітнішим і ефективніше. Ця вправа додатково задіює м’язи, які виконують поворот плечового суглоба усередину (підлопаткові м’язи, найширші м’язи спини). Виконувати його важче, ніж жим від грудей, оскільки плечовий суглоб утримується від рухів, що виходять за рамки фізіологічні, силою величезного числа м’язів, і здолати їх опір дуже непросто.'
url = ''
ex53 = Exercise.create(name: 'Жим штанги з-за голови', muscle_group: shoulders, description: des, youtube_url: url)
description = 'Візьміть штангу середнім хватом згори (не використовуйте занадто широкого хвата - це дуже утруднить виконання вправи і перевантажить плечові суглоби).
Підніміть штангу з підлоги до рівня грудей, сядьте на лавку, зробіть глибокий вдих, і, за рахунок зусилля тріцепсів і дельтовидних м’язів вижміть штангу вгору.
Затримайтеся на дві-три секунди, і повільно, на видиху, опустіть штангу за голову, до рівня трапецієвидних м`язів, але не опускайте її занадто низько, інакше можна отримати вивих в плечових суглобах.
Затримайтеся на пару секунд в цьому положенні, а потім знову тисніть штангу вгору.'
ex53.steps(description)


des = 'Підйом рук через сторони (розводки рук з гантелями в сторони) максимально навантажує середні пучки дельтовидних м’язів, а саме вони відповідають за візуальну ширину плечей - найосновніше, що робить фігуру спортивною і атлетичною. Вправа відноситься до ізолюючої, і формує рельєф і контури пучків дельтовидного м’яза.
Основні задіяні м’язи: середні пучки дельтовидних м’язів, надостні м’язи.
М’язи - асистенти: трапецієвидні м’язи, передній зубчастий м’яз.'
url = ''
ex54 = Exercise.create(name: 'Розведення рук з гантелями в сторони стоячи', muscle_group: shoulders, description: des, youtube_url: url)
description ='Встаньте прямо, ноги приблизно на ширині плечей, візьміть гантелі в руки, але не притискайте їх до стегон, а опустіть вниз, тримаючи перед собою на зігнутих під невеликим кутом руках.
Кисті рук злегка повернені всередину.
З цього положення, глибоко вдихнувши, зусиллям дельтовидних м’язів починайте піднімати гантелі вгору одночасно обома руками.
Руки плавно рухаються через сторони в площині тіла.
Піднявши гантелі до рівня плечей або трохи вище, видихніть, зробіть невелику паузу, під час якої спробуйте відчути м’язову напругу, плавно опустіть руки в початкове положення, і знову, без зупинки, робіть наступне повторення.'
ex54.steps(description)


des = 'Вправа розведення рук з гантелями в нахилі стоячи є абсолютно ізолюючою, і спрямована на опрацювання задніх пучків дельтовидного м’яза. Строго кажучи, сенс в його виконанні є тільки для професійних бодібілдерів, що вживають стероїдні препарати. Для новачків, і спортсменів - "натуралів" воно практично безглузде, оскільки не може досить навантажити дельти. До того ж, існують набагато ефективніші вправи, як для набору маси, так і для опрацювання рельєфу плечей. Але, якщо ви все-таки вирішили включити цю вправу у свій тренувальний цикл, виконуйте його з гантелями невеликої ваги, повільно, плавно, чітко і технічно. Це принесе більше користі, чим спроби зробити те ж саме з непідйомними вагами.'
url = ''
ex55 = Exercise.create(name: 'Розведення рук з гантелями в нахилі', muscle_group: shoulders, description: des, youtube_url: url)
description ='Візьміть в кожну руку по гантелі і прогніться в попереку вниз, щоб корпус був практично паралельний підлозі.
Спину при цьому не горбте, тримайте її прямою.
Для збереження правильного положення дивіться вперед, в дзеркало або на стіну прямо перед собою - цей прийом не дозволить вам порушити рівновагу і не допустить небезпечних прогинів в попереку.
У такому положенні зігніть в ліктях руки з гантелями під кутом приблизно в 45 градусів, причому кисті рук повинні дивитися один на одного.
Тепер починайте повільно розводити руки в сторони, концентруючись на задній поверхні дельтовидних м’язів.
Руки  розходяться в сторони, рухаючись при цьому в одній площині.
 У верхній точці плечі представляють практично пряму лінію, лікті дивляться вгору.
Після мінімальної затримки в такому положенні опускайте руки назад, утримуючи лікті під тим же самим кутом.
 Внизу не ударяйте гантелями один об одного, постарайтеся затримати їх так, щоб відстань між ними складала приблизно 10-12см.
 При підйомі рук вгору робіть вдих, а при опусканні - видих.'
ex55.steps(description)

#-------------------Legs------------------------->

des = 'Присідання зі штангою - це одна з кращих вправ для розвитку сили м’язів ніг, і надання їм величезних об’ємів. Але не зовсім правильно вважати, що присідання спрямовані виключно на опрацювання стегон. Ця базова вправа задіює більше половини м’язів усього тіла, включаючи ноги, м’язи спини, преса - адже для того, щоб утримати на спині штангу, вага якої порою перевалює за 100 кг, необхідно мати дуже сильний і розвинений "м’язовий корсет", який перешкоджатиме травмам попереку.
Основні працюючі м’язи: чотириглаві м’язи стегна, сідничні м’язи, біцепси стегна.'
url = ''
ex60 = Exercise.create(name: 'Присідання зі штангою' , muscle_group: legs, description: des, youtube_url: url)
description ='Покладіть штангу на стійки так, щоб її гриф знаходився трохи нижче за ключиці, "придсядьте" під неї, зігнувши ноги в колінах, руками обхопіть гриф штанги, передпліччя при цьому тримайте паралельно стійкам.
Ступні широко розставлені, носки поставлені нарізно.
Упріться в гриф спиною на рівні трапецієвидних м`язів або лопаток.
Зробіть вдих, і зніміть штангу із стійок, розігнув ноги в колінах.
Зробіть невеликий крок назад, станьте, і починайте повільно згинати ноги в колінах і тазостегнових суглобах, утримуючи правильну осанку.
Для того, щоб уникнути згинання (округлення) спини дивітеся або прямо перед собою, або трохи вгору.
Опускайтеся до тих пір, поки кут між стегном і гомілкою не стане прямим, нижче опускатися не рекомендується, оскільки в роботу підключаться сідничні м’язи, а колінний суглоб в такому положенні дуже нестабільний. З нижньої точки піднімайтеся до розгинання в колінних суглобів за рахунок потужного скорочення м’язів ніг.
Видих робіть під час підйому з штангою, вдих - під час опускання.'
ex60.steps(description)


des = 'Жим ногами в тренажері є непоганою заміною вправи присідання з і штангою для тих спортсменів, які мають проблеми із спиною, ця вправа забезпечить опрацювання великого масиву м’язів передньої поверхні стегна. По рівню навантаження вона трохи поступається присіданням, але перевершує по мірі ізольованості силової роботи чотириглавих м’язів стегна. Зміщення навантаження тут відбувається на пучки квадріцепса, розташовані ближче до медіальної сторони стегна, але, змінивши положення ступень, можна по-різному дававати навантаження на інші мязи.'
url = ''
ex61 = Exercise.create(name: 'Жим ногами в тренажері' , muscle_group: legs, description: des, youtube_url: url)
description ='Ляжте на спинку тренажера, щільно притисніться до неї усією спиною, руками візьміться за ручки.
Ноги поставте усією стопою на жимову платформу, так, щоб ступні були на ширині плечей або трохи вужче.
Великі пальці ніг дивляться в сторони, п’яти - один на одного, що дає задіяння зовнішніх пучків квадріцепса.
При зворотній постановці стоп ефект зміщується на добре усім знайомі медіальні пучки, що мають форму краплі, що нависає над коліном.
Приготуйтеся, зніміть платформу з блокуючих упор, і тисніть ногами її вгору, до тих пір, поки ноги не розпрямляться в колінних суглобах - це буде початкове положення при цій вправі.
Глибоко вдихніть, і плавно згинаючи ноги в колінах, опустіть платформу вниз, але не занадто глибоко, не до торкання ніг (колін) грудної клітки.
Оптимальний кут в колінних суглобах при цьому повинен складати 90 градусів.
Коли вага опуститься в нижню точку, напружтеся, і на видиху сильно надавіть ногами на платформу догори силою м’язів передньої поверхні стегна, але дивіться за тим, щоб не розгинати до кінця ноги у верхній фазі, інакше навантаження з м’язів зміститься на суглоби.
Не відривайте сідниці від сидіння - це може послужити причиною травм попереку!'
ex61.steps(description)


des = 'Рухи, що здійснюються в колінному суглобі при виконанні цієї вправи, задіюють в роботу практично тільки один м’яз - чотириглавий стегна (квадріцепс). Це означає, що ізолююча, і спрямована не на збільшення маси стегон, і тому розгинання ніг ніколи не зрівняється з присіданнями, а тільки впливає на їх форму і рельєф.
Основні працюючі м’язи: чотириглаві м’язи стегна (задіюються усі пучки, але найбільший ефект доводиться на латеральний і фронтальний пучок).
Допоміжні м’язи: біцепси стегон (у невеликій мірі)'
url = ''
ex62 = Exercise.create(name: 'Випрямлення ніг на тренажері' , muscle_group: legs, description: des, youtube_url: url)
description ='Сядьте на сидіння тренажера, ноги заведіть під спеціальний опору, яка повинна знаходитися на рівні нижньої третини гомілок, трохи вище стопи.
Відстань між ступнями повинна складати близько 30 см.
Спину щільно притуліть до спинки тренажера, руками можете взятися за спеціальні ручки, закріплені на рівні сидіння, якщо, звичайно, конструкція їх передбачає.
Тепер починайте плавно розгинати ноги в колінах, причому, стежте за тим, щоб виконувати рух в повній амплітуді.
Розгинайте ноги повністю, до тих пір, поки більше це вже неможливо буде зробити.
При русі ногами вгору намагайтеся робити видих, при опусканні ніг - вдох.'
ex62.steps(description)


des = 'Це ізолююча вправа згинання ніг на тренажері лежачи призначена для опрацювання групи мязів - згиначів стегна. Вона не дасть вам особливої м’язової маси і сили, але зробить контури стегон більш рельєфними і такими, що виділяються, відмежує стегно від сідничних м’язів.
Основні задіяні м’язи: біцепси стегна, напівсухожильні, напівперетинчасті.
М’язи-асистенти: сідничні, литкові м’язи.'
url = ''
ex63 = Exercise.create(name: 'Згинання ніг на тренажері лежачи' , muscle_group: legs, description: des, youtube_url: url)
description ='Ляжте животом на горизонтальну лавку, під низ живота можна підкласти або м’який валик, або щільно згорнутий рушник, або ще щось подібне.
 Це дозволить вам більше розтягнути біцепси стегон і зменшить вірогідність травм.
Просуньте ноги під опори так, щоб нижній його край знаходився на відстані 3-4 поперечних пальців від п’яти, а область коліна виходила за межі лавки, зіпріться на лікті, підніміть груди і голову, і дивіться прямо перед собою.
Починайте згинати ноги, працюйте не в повільному темпі, а дещо швидше, але і не кваптеся, виконуйте вправу без ривків, не відривайте таз від лавки.
При згинанні ніг робіть видих, при розгинанні - вдих.
Не випрямляйте повністю ноги в нижній частині руху, так ви понизите небажане навантаження на зв’язковий апарат коліна.
У верхній фазі руху згинайте ноги як можна сильніше, прагніть торкнутися п’ятами сідниць, додатково напружуйте м’язи.'
ex63.steps(description)


des = 'Ця базова вправа підйом на ноки стоячи для роботи над литковими м’язами, яка може максимально збільшити їх об’єм, надати силу, наростити масу.
Основні працюючі м’язи: литковий, задній, камбаловидний, м’язи – згинальні пальців.'
url = ''
ex64 = Exercise.create(name: 'Підйом на носки стоячи' , muscle_group: legs, description: des, youtube_url: url)
description ='По-перше, встаньте на підставку, розташуйте на ній третину підошви, зафіксуйте своє положення, упершись плечима в гриф штанги, або узявши її в руки і опустившись вниз до повного розгинання ліктів.
Таким чином, штанга не дасть вам втратити рівновагу.
Стопи при цьому розташовані паралельно один одному, або розставлені в сторони, залежно від того, яку частину литок ви хочете навантажити найбільше.
Спробуйте різні варіанти постановки стоп, знайдіть серед них той, який більше до душі.
Підніміться на носках на максимально можливу висоту, до межі скоротивши литкові м’язи.
Вгору додатково напружтеся, зробіть коротку паузу, і опустіться вниз до повного розгинання стоп в суглобах.
Постарайтеся торкнутися підлоги п’ятами.
Дотримуйте основного принципу тренування литкових м’язів : максимальну амплітуду руху.
Інакше вам буде дуже важко добре проробити литки.                                                                                                                                                                                                                                                                                                                                                                                                Витримавши внизу істотну паузу, знову потужним рухом підніміться вгору. Виконуйте вправу не менше 15 разів.
Не згинайте ноги в колінних суглобах, це дасться знатит зміщенням основного фокусу навантаження на камбаловидні м’язи.
Опускайтеся і піднімайтеся плавно, без пружинячих скорочень м’язів, особливо внизу, інакше легко можна отримати травму ахілесових сухожиль.
Не горбте спину, особливо якщо тримаєте штангу внизу, на витягнутих руках, це може закінчитись втратою рівноваги і падінням.'
ex64.steps(description)


des = 'Для накачачки камбаловидних м’язів немає нічого кращого, ніж підйоми на носки сидячи. Виконуючи стоячи подібну вправу, ви по максимуму задіюєте литковий м’яз, але не даєте працювати в повну силу камбаловидному, а саме він, збільшуючись в розмірах, робить литку візуально більшою. Особливо помітно її збільшення стає із зовнішнього боку.'
url = ''
ex65 = Exercise.create(name: 'Підйом на носки сидячи' , muscle_group: legs, description: des, youtube_url: url)
description ='Сядьте на лаву, поставте ноги під валики упорів тренажера, ступні - на підставку.
Валики повинні щільно упиратися в нижні відділи квадрицепсов, а стопи на одну свою третину знаходитися на підставці.
Прийміть рівне положення, руками можна взятися за ручки, які зазвичай прикріплені на рівні сидіння.
Робіть вдих, а потім підніміться на шкарпетки як можна вище, зрушуючи упори вгору.
Вгорі бажано зупинитися на декілька секунд, постаравшись в цей час максимально скоротити м’язи.
Потім видихніть, і постарайтеся опустити п’яти практично до підлоги, розтягуючи м’язи майже до межі.
З цього положення, відчувши усе зростаюче розтягування камбаловидного м’яза, знову піднімайтеся на носках вгору.'
ex65.steps(description)


des = 'Випади – це базова вправа для м’язів ніг, яка головним чином спрямована на тренування сідниць і м’язів стегон (по більшій частині, квадрицепса). '
url = ''
ex66 = Exercise.create(name: 'Випади з гантелями ', muscle_group: legs, description: des, youtube_url: url)
description = 'Ступні розташовані паралельно трохи ширше стегон.
Крок повинен бути досить широким, щоб нога, зігнута в коліні, утворила прямий кут щодо статі.
Коліно не повинно виходити за лінію носка і «гуляти», щоб уникнути травм воно повинно залишатися нерухомим.
Коліно задньої ноги повинне знаходитися максимально близько до підлоги, але не торкатися його.
Підніматися з присідаючи слід, максимально напружуючи квадрицепс.'
ex66.steps(description)

#-------------------Press------------------------>

des = 'Скручування - це підйом тулуба у напрямку від лаки до колін, не відриваючи попереку від лави. Дуже швидко скручування на звичайній, горизонтально розташованій лавці стають занадто легкими для спортсменів, тоді на допомогу приходить нехитрий прийом - постановка лавки під кутом, що примушує працювати проти сили тяжіння, і збільшує навантаження на м’язи живота. Динамічно працює тут верхня частина прямого м’яза живота, але деяке навантаження доводиться і на її нижню частину.'
url = ''
ex70 = Exercise.create(name: 'Скручування на похилій лавці', muscle_group: press, description: des, youtube_url: url)
description = 'Встановіть лавку під кутом 20 - 30 градусів, або більше - усе залежить від того на скільки ви фізично підготовлені.
Сядьте на край лави, міцно зафіксувавши гомілки внизу, під спеціальним валиком.
Руки заведіть за голову, обхопивши ними потилицю, або схрестіть їх перед собою.
З цього положення починайте повільно опускатися назад, причому, стежте за тим, щоб не розпрямляти спину - вона має бути заокруглена.
Якщо ж ви не дотримуватиметесь цієї умови, то відразу відчуєте дуже сильне напруження в попереку, яке тут не потрібне.
Не лягайте повністю на лавку в нижній точці, постарайтеся взагалі не торкатися її лопатками, опускайтеся зовсім на невелику відстань, до тих пір, поки ще зберігається - та напруга в м’язах живота.
Як тільки ви відчули наростаючу напругу в попереку - припиніть опускання тулуба і починайте підйом, і обов’язково зверніть увагу на те, щоб спина була округленою під час цієї фази.'
ex70.steps(description)


des = 'Підйом ніг висячи на турніку це найпотужніша і, мабуть, найефективніша вправа для пресу з усіх представлених, вправ номер один. М’язи черевного пресу опрацьовуються повністю, з усіма видами навантажень, крім того, змінюючи кут згинання тазу, можна пропрацювати також і косі м’язи живота. На жаль, роблять його не багато, в першу чергу із-за слабкості хвата, коли не виходить довго утримуватися на перекладині - пальці втомлюються швидше, ніж прес, і лінь, властивій кожній живій людині. Проте перша проблема може бути розв’язана з використанням кистьових ременів, а друга - стимулюванням себе, наприклад, початком пляжного сезону.'
url = ''
ex71 = Exercise.create(name: 'Підйом ніг висячи', muscle_group: press, description: des, youtube_url: url)
description = 'Підійдіть до перекладини, підстрибнувши, вхопіться за неї обома руками приблизно на ширині плечей.
Важливо, щоб у висі ви не зачіпали ногами об підлогу, тому відрегулюйте перекладину з урахуванням вашого росту - вона повинна знаходитися приблизно на 10 см вище витягнутої руки.
 Отже, початкове положення - у висі на перекладині, руки повністю розігнуті в ліктях, спина пряма.
Зробіть глибокий вдох, і на вдиху, трохи відвівши спочатку коліна назад, зусиллям м’язів пресу підніміть їх вище за пояс разом з усім тазом.
При невеликій амплітуді руху навантаження на прес значно менше, тому не давайте собі розслабитися, як би важко вам не було.
Вгорі надайте додаткове зусилля пресу, скоротіть його ще сильніше, і спокійно опускайте ноги вниз, бажано, не розгинаючи їх в колінах.'
ex71.steps(description)


des = 'Вправа підйом ніг на похилій лавці добре робити перед тренуванням або після усіх фізичних навантажень. Перед самою вправою варто в упорі зробити підйоми колін, потім повороти тулуба з грифом. При підведенні тазу і згортання тулуба, починають працювати в основному верхні частини прямих м’язів живота.
Слід зауважити, що вправа не така проста, як здається. Тим, хто вперше його виконує можуть виявитися труднощі при виконанні з нижньою частиною живота, сліду для полегшення навантаження по можливості понизити кут нахилу лавки або дошки.'
url = ''
ex72 = Exercise.create(name: 'Підйом ніг на похилій лавці', muscle_group: press,description: des, youtube_url: url)
description = 'Приляжте на похилу лавку таким чином, щоб спина була притиснута до лавки, голова вище за ноги.
Піднявши руки за голову, направте їх до краю лавки і міцно її обхопіть (узяти в обхват можна і будь-яку іншу опору).
Випрямте ноги, напружуючи ступні, підніміть їх на максимально можливу висоту.
Через декілька секунд, повільно опустіть.
Повертаючись в початкове положення, замріть на 2 сек, не допускаючи торкання п’ятами поверхні лавки.
Важливим моментом в цій вправі є правильне дихання: на етапі підйому ніг і стискання черевної порожнини - глибокий видих, опускання ніг - вдих.'
ex72.steps(description)


des = 'Додатково під час роботи над м’язами живота можна виконати згинання тіла на верхньому блоці, верхньої частини тіла донизу, тримаючи рукоятку верхнього блоку за головою. Вправа дозволяє регулювати вага так, як вам зручно, і навіть непідготовленим і слабким людям буде неважко його виконати.
Основні задіяні м’язи: прямий м’яз живота
Допоміжні: поперекові м’язи, розгиначі спини.'
url = ''
ex73 = Exercise.create(name: 'Згинання тіла на блоці', muscle_group: press, description: des, youtube_url: url)
description = 'Заздалегідь відрегулюйте вагу, з якою ви хочете виконати вправу, потім прийміть положення, з якого ви виконуватимете згинання корпусу.
Встаньте на коліна лицем до тренажера, утримуючи його натягнутий трос за руків’я обома руками, тримаючи їх над головою.
Прагніть торкнутися колін лобом, але тільки намічайте цей рух, не опускайтеся занадто глибоко. У будь-якому випадку стежте за відчуттям повного скорочення м’язів живота, якщо ж скорочення їх неповне, ви щось робите не так.
Обмежте рухи в попереку до мінімуму, нехай працює прес, а не спина.
Внизу дуже важливе додаткове вольове скорочення м’язів, а пауза може бути дуже значною.
На м’язи черевного пресу в цей час падає значне статичне навантаження, яке можна ще більше збільшити шляхом подовження паузи і примусового скорочення м’язів.
Після паузи починайте повільно розгинатися, але не до кінця, а так, щоб не було перерозгинання в хребті.
Амплітуда руху дуже мала, найголовніше тут - це зосередження на скороченні м’язів, а зайвий розмах просто шкідливий.'
ex73.steps(description)


des = 'Ця вправа призначена для ущільнення косих м’язів живота.'
url = ''
ex74 = Exercise.create(name: 'Повороти тулуба в положенні сидячи', muscle_group: press, description: des, youtube_url: url)
description = 'Сядьте на кінець лавки, впершись ступнями в підлогу і злегка розставивши ноги.
Покладіть на плечі гриф від штанги або штангу с вагою, якщо один гриф залегкий.
Утримуючи голову нерухомо, поверніть тулуб убік так далеко, як тільки можете.
На секунду затримаєтеся в крайній точці руху, потім поверніть тулуб в інший бік.
Рух має бути плавним, без ривків і розгойдування.
Оскільки ця вправа скорочує косі м’язи живота, але виконується без того, що обтяжило, воно ущільнює м’язи, але не збільшує їх об’єм, що може візуально розширити область талії.'
ex74.steps(description)

=begin
# CARDIO
#----------------------------------------------------------------------------------->

des = ''
url = ''
ex80 = Exercise.create(name: 'Біг на біговій доріжчі', muscle_group: press, description: des, youtube_url: url)
description = 'Починати тренування на біговій доріжці потрібно з ходьби або легкого бігу і в процесі поступово збільшувати швидкість.
Сказати, з якою швидкістю потрібно бігати дуже важко, так як у всіх різний рівень підготовки.
Звертати увагу потрібно не на швидкість, а на пульс. Для дорослої людини використовується проста формула для підрахунку верхнього порогу пульсу: «220-вік в роках».
 Якщо вам 30 років, то верхній поріг ЧСС буде 190 ударів на хвилину.
Займатися на біговій доріжці потрібно близько 30 хвилин. Новачкам дозволяється перший час витрачати на тренування по 15-20 хвилин. Займатися більше години особливо не рекомендується, так як біг навантажує хребет і суглоби.'
ex74.steps(description)
=end

# Programs

pt1 = ProgramType.create(name: 'Набір маси')
pt2 = ProgramType.create(name: 'Схуднення')
pt3 = ProgramType.create(name: 'Збільшення сили')

# Ectomorph standard program

td1 = TrainingDay.create(description: 'День 1')
td2 = TrainingDay.create(description: 'День 2')
td3 = TrainingDay.create(description: 'День 3')
td4 = TrainingDay.create(description: 'День 4')
td5 = TrainingDay.create(description: 'День 5')
td6 = TrainingDay.create(description: 'День 6')
td7 = TrainingDay.create(description: 'День 7')

TrainingDayExercise.create(training_day: td1, exercise: ex60, rest: 3, sets: 3, repetitions: 8)
TrainingDayExercise.create(training_day: td1, exercise: ex61, rest: 2, sets: 3, repetitions: 8)
TrainingDayExercise.create(training_day: td1, exercise: ex53, rest: 2, sets: 3, repetitions: 6)
TrainingDayExercise.create(training_day: td1, exercise: ex51, rest: 2, sets: 2, repetitions: 8)

TrainingDayExercise.create(training_day: td3, exercise: ex20, rest: 3, sets: 3, repetitions: 8)
TrainingDayExercise.create(training_day: td3, exercise: ex23, rest: 2, sets: 3, repetitions: 8)
TrainingDayExercise.create(training_day: td3, exercise: ex22, rest: 2, sets: 3, repetitions: 10)
TrainingDayExercise.create(training_day: td3, exercise: ex41, rest: 2, sets: 3, repetitions: 8)
TrainingDayExercise.create(training_day: td3, exercise: ex43, rest: 2, sets: 2, repetitions: 8)

TrainingDayExercise.create(training_day: td5, exercise: ex5, rest: 2, sets: 2, repetitions: 10)
TrainingDayExercise.create(training_day: td5, exercise: ex1, rest: 3, sets: 3, repetitions: 8)
TrainingDayExercise.create(training_day: td5, exercise: ex2, rest: 3, sets: 2, repetitions: 8)
TrainingDayExercise.create(training_day: td5, exercise: ex31, rest: 2, sets: 3, repetitions: 8)

description = 'Ектоморф найчастіше має дрібні суглоби і невелику м’язеву масу, довгі тонкі кінцівки та вузькі плечі. Має швидки метаболізм, що спричиняє швидку втрату м’язевої маси. Може легко все їсти, не отримуючи жирових відкладень.
При складанні програми для цього типу статури акцент потрібно зробити на великих м’язових група: ноги, спина, груди. Слід уникати високо-об’ємних тренувань, плануючи не більше 15 підходів за одне заняття. Не робіть багато кардіо, хіба що на біг на доріжці для розминки.
Перед кожним заняттям потрібно робити розминку 5-10 хвилин для розігрівання м’язів.
Кількість прийомів їжі має становити 5-6 годин в день. Варто здійснювати прийом їжі за 40-60 хвилин до сну, наприклад, творог. 50-60% раціону повинні складати складні вуглеводи, 25% - білок, 15-25% - жири.'
TrainingProgram.create(name: 'Програма тренувань для ектоморфа', description: description, body_type: 0, male_type: 0, first_day: td1,
                       second_day: td2, third_day: td3, fourth_day: td4,fifth_day: td5, sixth_day: td6,seventh_day: td7, user: admin)

# Mesomorph standard

td1 = TrainingDay.create(description: 'День 1')
td2 = TrainingDay.create(description: 'День 2')
td3 = TrainingDay.create(description: 'День 3')
td4 = TrainingDay.create(description: 'День 4')
td5 = TrainingDay.create(description: 'День 5')
td6 = TrainingDay.create(description: 'День 6')
td7 = TrainingDay.create(description: 'День 7')

TrainingDayExercise.create(training_day: td1, exercise: ex5, rest: 2, sets: 2, repetitions: 8)
TrainingDayExercise.create(training_day: td1, exercise: ex1, rest: 2, sets: 3, repetitions: 8)
TrainingDayExercise.create(training_day: td1, exercise: ex2, rest: 2, sets: 3, repetitions: 12)
TrainingDayExercise.create(training_day: td1, exercise: ex52, rest: 2, sets: 3, repetitions: 10)
TrainingDayExercise.create(training_day: td1, exercise: ex54, rest: 2, sets: 3, repetitions: 12)
TrainingDayExercise.create(training_day: td1, exercise: ex55, rest: 2, sets: 3, repetitions: 12)
TrainingDayExercise.create(training_day: td1, exercise: ex70, rest: 2, sets: 5, repetitions: 25)

TrainingDayExercise.create(training_day: td3, exercise: ex20, rest: 2, sets: 3, repetitions: 10)
TrainingDayExercise.create(training_day: td3, exercise: ex21, rest: 2, sets: 3, repetitions: 12)
TrainingDayExercise.create(training_day: td3, exercise: ex25, rest: 2, sets: 2, repetitions: 12)
TrainingDayExercise.create(training_day: td3, exercise: ex31, rest: 2, sets: 4, repetitions: 10)
TrainingDayExercise.create(training_day: td3, exercise: ex35, rest: 2, sets: 3, repetitions: 12)
TrainingDayExercise.create(training_day: td3, exercise: ex41, rest: 2, sets: 4, repetitions: 10)
TrainingDayExercise.create(training_day: td3, exercise: ex43, rest: 2, sets: 3, repetitions: 12)
TrainingDayExercise.create(training_day: td3, exercise: ex71, rest: 2, sets: 3, repetitions: 25)

TrainingDayExercise.create(training_day: td5, exercise: ex60, rest: 2, sets: 3, repetitions: 10)
TrainingDayExercise.create(training_day: td5, exercise: ex61, rest: 2, sets: 3, repetitions: 10)
TrainingDayExercise.create(training_day: td5, exercise: ex62, rest: 2, sets: 2, repetitions: 12)
TrainingDayExercise.create(training_day: td5, exercise: ex63, rest: 1, sets: 3, repetitions: 10)
TrainingDayExercise.create(training_day: td5, exercise: ex65, rest: 1, sets: 4, repetitions: 15)
TrainingDayExercise.create(training_day: td5, exercise: ex70, rest: 1, sets: 3, repetitions: 25)
description = 'Мезоморфи є генетичними щасливчиками з ідеальною платформою для побудови м’язів. Відрізняються атлетичною статурою, досить легко набирають м’язову масу і витрачають жирову.
Організм мезоморфа добре відгукується на об’ємні силові тренування. Заняття повинні бути інтенсивними, важкими і тривати 45-60 хвилин. Найкращим видом кардіо для спалювання жиру є біг підтюпцем та інтервальний біг.
Раціон повинен складатися з 40-45% вуглеводів, 35-40% білків та 25-30% жирів. Кількість прийомів їжі - 4-5 разів на день.'
TrainingProgram.create(name: 'Програма тренувань для мезоморфа', description: description,  body_type: 1, male_type: 0, first_day: td1,
                       second_day: td2, third_day: td3, fourth_day: td4,fifth_day: td5, sixth_day: td6,seventh_day: td7, user: admin)

# Endomorph standard

td1 = TrainingDay.create(description: 'День 1')
td2 = TrainingDay.create(description: 'День 2')
td3 = TrainingDay.create(description: 'День 3')
td4 = TrainingDay.create(description: 'День 4')
td5 = TrainingDay.create(description: 'День 5')
td6 = TrainingDay.create(description: 'День 6')
td7 = TrainingDay.create(description: 'День 7')

TrainingDayExercise.create(training_day: td1, exercise: ex60, rest: 2, sets: 4, repetitions: 15)
TrainingDayExercise.create(training_day: td1, exercise: ex61, rest: 2, sets: 3, repetitions: 12)
TrainingDayExercise.create(training_day: td1, exercise: ex62, rest: 2, sets: 3, repetitions: 15)
TrainingDayExercise.create(training_day: td1, exercise: ex63, rest: 1, sets: 3, repetitions: 12)
TrainingDayExercise.create(training_day: td1, exercise: ex52, rest: 1, sets: 4, repetitions: 10)
TrainingDayExercise.create(training_day: td1, exercise: ex51, rest: 1, sets: 3, repetitions: 12)
TrainingDayExercise.create(training_day: td1, exercise: ex70, rest: 1, sets: 3, repetitions: 25)
TrainingDayExercise.create(training_day: td1, exercise: ex71, rest: 1, sets: 3, repetitions: 15)

TrainingDayExercise.create(training_day: td3, exercise: ex20, rest: 2, sets: 4, repetitions: 12)
TrainingDayExercise.create(training_day: td3, exercise: ex24, rest: 2, sets: 3, repetitions: 12)
TrainingDayExercise.create(training_day: td3, exercise: ex25, rest: 2, sets: 3, repetitions: 15)
TrainingDayExercise.create(training_day: td3, exercise: ex41, rest: 1, sets: 3, repetitions: 12)
TrainingDayExercise.create(training_day: td3, exercise: ex43, rest: 1, sets: 3, repetitions: 12)
TrainingDayExercise.create(training_day: td3, exercise: ex70, rest: 1, sets: 3, repetitions: 25)
TrainingDayExercise.create(training_day: td3, exercise: ex71, rest: 1, sets: 3, repetitions: 15)

TrainingDayExercise.create(training_day: td5, exercise: ex5, rest: 2, sets: 4, repetitions: 12)
TrainingDayExercise.create(training_day: td5, exercise: ex1, rest: 2, sets: 3, repetitions: 8)
TrainingDayExercise.create(training_day: td5, exercise: ex2, rest: 2, sets: 3, repetitions: 12)
TrainingDayExercise.create(training_day: td5, exercise: ex3, rest: 1, sets: 3, repetitions: 10)
TrainingDayExercise.create(training_day: td5, exercise: ex31, rest: 1, sets: 3, repetitions: 10)
TrainingDayExercise.create(training_day: td5, exercise: ex70, rest: 1, sets: 3, repetitions: 25)
TrainingDayExercise.create(training_day: td5, exercise: ex71, rest: 1, sets: 3, repetitions: 15)


description = 'Ендоморфи володіють значною масою при досить низькому зрості. Мають масивний скелет і досить сильні ноги. Легко набирають жирову масу і довго не можуть від неї позбутися.
Тренування повинні бути не дуже об’ємні, оскільки можуть призвести до втрати м’язевої маси. Тривалість одного заняття - 65-75 хвилин. При цьому потрібно використовувати великі ваги для сприяння перетворення жиру в м’язи.
Важливою особливістю тренувань ендоморфів є довга тривалість кардіо - 30-40 хвилин на одне заняття.
Раціон повинен виглядати так: 30-35% вуглеводів, 55-60% білків та 10-15% жирів. Їжте багато овочів та клітковини, пийте по 3 літри води на день. Потрібно відмовитися від солодощів та цукру.'
TrainingProgram.create(name: 'Програма тренувань для ендоморфа', description: description, body_type: 2, male_type: 0, first_day: td1,
                       second_day: td2, third_day: td3, fourth_day: td4,fifth_day: td5, sixth_day: td6,seventh_day: td7, user: admin)

# Womens

td1 = TrainingDay.create(description: 'День 1')
td2 = TrainingDay.create(description: 'День 2')
td3 = TrainingDay.create(description: 'День 3')
td4 = TrainingDay.create(description: 'День 4')
td5 = TrainingDay.create(description: 'День 5')
td6 = TrainingDay.create(description: 'День 6')
td7 = TrainingDay.create(description: 'День 7')

TrainingDayExercise.create(training_day: td1, exercise: ex21, rest: 2, sets: 3, repetitions: 10)
TrainingDayExercise.create(training_day: td1, exercise: ex23, rest: 2, sets: 3, repetitions: 12)
TrainingDayExercise.create(training_day: td1, exercise: ex26, rest: 2, sets: 2, repetitions: 15)
TrainingDayExercise.create(training_day: td1, exercise: ex51, rest: 2, sets: 2, repetitions: 12)

TrainingDayExercise.create(training_day: td3, exercise: ex3, rest: 2, sets: 3, repetitions: 12)
TrainingDayExercise.create(training_day: td3, exercise: ex7, rest: 2, sets: 3, repetitions: 12)
TrainingDayExercise.create(training_day: td3, exercise: ex66, rest: 2, sets: 2, repetitions: 15)
TrainingDayExercise.create(training_day: td3, exercise: ex41, rest: 1, sets: 2, repetitions: 12)
TrainingDayExercise.create(training_day: td3, exercise: ex71, rest: 1, sets: 2, repetitions: 15)
TrainingDayExercise.create(training_day: td3, exercise: ex70, rest: 1, sets: 2, repetitions: 25)

TrainingDayExercise.create(training_day: td5, exercise: ex60, rest: 2, sets: 3, repetitions: 20)
TrainingDayExercise.create(training_day: td5, exercise: ex62, rest: 2, sets: 2, repetitions: 15)
TrainingDayExercise.create(training_day: td5, exercise: ex64, rest: 2, sets: 3, repetitions: 20)
TrainingDayExercise.create(training_day: td5, exercise: ex9, rest: 1, sets: 2, repetitions: 12)
TrainingDayExercise.create(training_day: td5, exercise: ex24, rest: 1, sets: 1, repetitions: 15)
TrainingDayExercise.create(training_day: td5, exercise: ex35, rest: 1, sets: 2, repetitions: 12)


description = 'В першу чергу дана програма тренувань для дівчат спрямована на зміцнення грудних м’язів, на формування міцного пресу у дівчат і позбавлення їх від целюліту.
 Вмістити ці всі акценти в одній універсальній тренувальній програмі зовсім не складно. Для того, щоб навантажити груди використовуються 4 вправи, жим лежачи головою донизу – це одна з найефективніших вправ для для збільшення та підняття грудей, призначення решти ж вправ – для поліпшення їх форми та вигляду. Що до целюліту, то тут акцент буде полягати у зміні структури сполучних тканин у місцях де жир відкладається найбільше. Присідання та випади з гантелями – ось основні вправи, які будуть використовуватись для таких цілей, як зменшення целюліту. Виконання цих вправ значно покращить рівень кровопостачання стегон та сідниць, дуже серйозно стимулюють ріст сполучної тканини, покращують рівень виведення шкідливих токсинів з організму, тощо. Як видно з програми, що тут чомусь відносно мало вправ для накачки преса, але це зовсім не так, тут їх більш ніж достатньо, оскільки, для того щоб отримати красивий і міцний прес, то необхідно найперше скинути зайву вагу, а як відомо локального спалювання жиру не буває в природі.
В кінці тренування обов’язово проведіть аеробне навантаження. Можна використати бігову доріжку чи велотренажер протягом 20-30 хвилин.'
TrainingProgram.create(name: 'Універсальна програма для жінок', description: description, male_type: 1, first_day: td1,
                       second_day: td2, third_day: td3, fourth_day: td4,fifth_day: td5, sixth_day: td6,seventh_day: td7, user: admin)